#include <iostream>
#include <string>
using namespace std;

string yearToTrack(int n, string t[]) {
	int a = n / 1000 + (n / 100) % 10 + (n / 10) % 10 + n % 10;
	int b = a / 10 + a % 10 - 1;
	return t[b];
}

string nameToFilm(string name, string f[]) {
	int n = (int)name[0] + 128;
	return f[n];
}

string surnameToVip(string surname, string v[]) {
	int n = (int)surname[0] + 128;
	return v[n];
}

int main() {
	setlocale(LC_ALL, "Russian");
	string films[28] = {"Бесславные ублюдки", "Проклятый остров", "Шрек", "Убить Билла", "Человек-паук", "Карты, деньги, два ствола", "Операция Ы", "Ирония судьбы",
					    "Маска", "Железный человек", "Аватар", "Гарри Поттер и узник Азкабана", "Гарри Поттер и Кубок Огня", "Гарри Поттер и Орден Феникса",
						"Джентельмены удачи", "Брюс Всемогущий", "Шоу Трумана", "Один дома", "Хроники Нарнии", "Зелёный слоник", "Начало", "Титаник", "Люди Икс",
						"Мстители", "Криминальное чтиво", "12 лет рабства", "Брат", "Груз 200"
	};
	string vips[28] = {"Джонни Депп", "Роберт Дауни мл.", "Дмитрий Нагиев", "Марк Цукерберг", "Виктор Цой", "Борис Гребенщиков", "Эдди Мёрфи", "Стив Джобс",
					   "Гарик Матриросян", "Альберт Шипакцян", "МОРГЕНШТЕРН", "Скриптонит", "Хофманнита", "Марк Твен", "Стивен Кинг", "Мартин Скорцеза",
					   "Артур Чапарян", "Том Хэнкс", "Криштиану Роналду", "Эрлинг Холланд", "Лионель Месси", "Леди Гага", "Алла Пугачёва", "Иосиф Кобзон",
					   "Паша Техник", "Дима Билан", "Бен Аффлек", "Арнольд Шварцнеггер"

	};
	string tracks[9] = { "Michael Jackson - \"Billie Jean\"", "Кино - \"Следи за собой\"", "Аквариум - \"25 к 10\"", "Hugo - \"99 Problems\"", "Stromae - \"Alors on dance\"",
						"Макс Корж - \"Небо поможет нам\"", "Скриптонит - \"Цепи\"", "PHARAOH - \"Дико например\"", "Tobu - \"Candyland\""

	};
	string name, surname, year;
	cout << "Привет, у нас есть немного развлекательного контента для вас. Хотите пройти тест?\nТогда введите ваше имя, фамилию и год рождения." << endl;
	cout << "Имя: ";
	cin >> name;
	cout << "Фамилия: ";
	cin >> surname;
	cout << "Год рождения: ";
	cin >> year;
	cout << "Супер! Ваш фильм - это " + nameToFilm(name, films) + ". Ваша звезда - " + surnameToVip(surname, vips) + "!" << endl <<
		"Саундтрек для вас на сегодня - " + yearToTrack(stoi(year), tracks) + "." << endl;
	
	return 0;
}